// Какое будет выведено значение: let x = 5; alert( x++ ); ? // 5
let firstTask = 5;
console.log(x++); // так як постфіксний інкремент збільшить число на 1 після того, як воно виведеться в коносль.

// Чему равно такое выражение: [ ] + false - null + true ? // результат NaN
let secTask = [] + false - null + true; // [] -> перетвореться в '' - пусту строку, а строка при конкатенації перетворює будь яке значення в строкове. Поті ми намагаємся виконати не матиматичну операцію і отримуємо NaN бо неможливо від строки відняти null

// Что выведет этот код: let y = 1; let x = y = 2; alert(x); ? // 2
let thirdTask = 1;
let thirdTask_2 = (thirdTask = 2);
console.log(thirdTask_2);

// Чему равна сумма [ ] + 1 + 2? // '12'
let fourthTask = [] + 1 + 2; // - в другому прикладі я вже вияснив що при виконанні додавання з використанням пустого масиву дані стают строковими.

// Что выведет этот код: alert( "1"[0] )? // 1
console.log("1"[1]); // так як ми можемо звертатися таким чином до символів строкі то воно нам виведе 1 бо 1 є першим символом і має індекс 0.

// Чему равно 2 && 1 && null && 0 && undefined ? // null
console.log(2 && 1 && null && 0 && undefined); // - логічний оператор &&(і) зупиняється на першому ложному виразі і повертає його, або самий кінцевий, якщо всі вирази правдиві

// Есть ли разница между выражениями? !!( a && b ) и (a && b)? // так, різниця є, в першому випадку нам повернеться boolean, в другому один з операндів
console.log(!!(a && b)); // результат буде boolean типу
console.log(a && b); // результат буде один із операндів

// Что выведет этот код: alert( null || 2 && 3 || 4 ); ? // 3
console.log(null || (2 && 3) || 4); // - результатом виразу буде число 3 так як логічний оператор ||(або) зупиняється на правдивому результаті і повертає його, а якщо всі брехливі то повертає останній брехливий

// a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ? // ні, бо хоч візуально масиви які їм присвоюються і виглядають однаково, але вони різні і займають різні ячейки пам'яті і тому змінним присвоєнно різні лінки на різні масиви;
let a = [1, 2, 3];
let b = [1, 2, 3];
console.log(a == b); // false

// Что выведет этот код: alert( +"Infinity" ); ? Infinity like a number type
console.log(+"Infinity");

// Верно ли сравнение: "Ёжик" > "яблоко"? так, бо ми можемо порівнювати строки
console.log("Ёжик" > "яблоко");

// Чему равно 0 || "" || 2 || undefined || true || falsе ? // 2
console.log(0 || "" || 2 || undefined || true || falsе) // перший правдивий результат цифра 2
